RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1A/source/pin_packages/cyhal_psoc6_02_100_wlcsp.c
/* Connections for: peri_tr_io_output */
/* The actual channel_num has no value to how the connection works. However, the HAL driver needs
   to know the index of the input or output trigger line. Store that in the channel_num field
   instead. */
const cyhal_resource_pin_mapping_t cyhal_pin_map_peri_tr_io_output[6] = {
    {0u, 0u, P0_4, P0_4_PERI_TR_IO_OUTPUT0},
    {0u, 1u, P0_5, P0_5_PERI_TR_IO_OUTPUT1},
    {0u, 0u, P6_4, P6_4_PERI_TR_IO_OUTPUT0},
    {0u, 1u, P6_5, P6_5_PERI_TR_IO_OUTPUT1},
    {0u, 0u, P11_3, P11_3_PERI_TR_IO_OUTPUT0},
    {0u, 1u, P11_4, P11_4_PERI_TR_IO_OUTPUT1},
};

/* Connections for: scb_i2c_scl */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_i2c_scl[19] = {
    {0u, 0u, P0_2, P0_2_SCB0_I2C_SCL},
    {7u, 0u, P1_0, P1_0_SCB7_I2C_SCL},
    {1u, 0u, P2_0, P2_0_SCB1_I2C_SCL},
    {9u, 0u, P2_4, P2_4_SCB9_I2C_SCL},
    {5u, 0u, P5_0, P5_0_SCB5_I2C_SCL},
    {10u, 0u, P5_4, P5_4_SCB10_I2C_SCL},
    {3u, 0u, P6_0, P6_0_SCB3_I2C_SCL},
    {8u, 0u, P6_0, P6_0_SCB8_I2C_SCL},
    {6u, 0u, P6_4, P6_4_SCB6_I2C_SCL},
    {8u, 0u, P6_4, P6_4_SCB8_I2C_SCL},
    {4u, 0u, P7_0, P7_0_SCB4_I2C_SCL},
    {4u, 0u, P8_0, P8_0_SCB4_I2C_SCL},
    {11u, 0u, P8_4, P8_4_SCB11_I2C_SCL},
    {2u, 0u, P9_0, P9_0_SCB2_I2C_SCL},
    {1u, 0u, P10_0, P10_0_SCB1_I2C_SCL},
    {5u, 0u, P11_0, P11_0_SCB5_I2C_SCL},
    {6u, 0u, P12_0, P12_0_SCB6_I2C_SCL},
    {6u, 0u, P13_0, P13_0_SCB6_I2C_SCL},
    {12u, 0u, P13_4, P13_4_SCB12_I2C_SCL},
};

/* Connections for: scb_i2c_sda */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_i2c_sda[18] = {
    {0u, 0u, P0_3, P0_3_SCB0_I2C_SDA},
    {7u, 0u, P1_1, P1_1_SCB7_I2C_SDA},
    {1u, 0u, P2_1, P2_1_SCB1_I2C_SDA},
    {9u, 0u, P2_5, P2_5_SCB9_I2C_SDA},
    {5u, 0u, P5_1, P5_1_SCB5_I2C_SDA},
    {10u, 0u, P5_5, P5_5_SCB10_I2C_SDA},
    {3u, 0u, P6_1, P6_1_SCB3_I2C_SDA},
    {8u, 0u, P6_1, P6_1_SCB8_I2C_SDA},
    {6u, 0u, P6_5, P6_5_SCB6_I2C_SDA},
    {8u, 0u, P6_5, P6_5_SCB8_I2C_SDA},
    {4u, 0u, P7_1, P7_1_SCB4_I2C_SDA},
    {4u, 0u, P8_1, P8_1_SCB4_I2C_SDA},
    {2u, 0u, P9_1, P9_1_SCB2_I2C_SDA},
    {1u, 0u, P10_1, P10_1_SCB1_I2C_SDA},
    {5u, 0u, P11_1, P11_1_SCB5_I2C_SDA},
    {6u, 0u, P12_1, P12_1_SCB6_I2C_SDA},
    {6u, 0u, P13_1, P13_1_SCB6_I2C_SDA},
    {12u, 0u, P13_5, P13_5_SCB12_I2C_SDA},
};

/* Connections for: scb_spi_m_clk */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_m_clk[14] = {
    {0u, 0u, P0_4, P0_4_SCB0_SPI_CLK},
    {1u, 0u, P2_2, P2_2_SCB1_SPI_CLK},
    {5u, 0u, P5_2, P5_2_SCB5_SPI_CLK},
    {3u, 0u, P6_2, P6_2_SCB3_SPI_CLK},
    {8u, 0u, P6_2, P6_2_SCB8_SPI_CLK},
    {6u, 0u, P6_6, P6_6_SCB6_SPI_CLK},
    {8u, 0u, P6_6, P6_6_SCB8_SPI_CLK},
    {4u, 0u, P7_2, P7_2_SCB4_SPI_CLK},
    {4u, 0u, P8_2, P8_2_SCB4_SPI_CLK},
    {2u, 0u, P9_2, P9_2_SCB2_SPI_CLK},
    {1u, 0u, P10_2, P10_2_SCB1_SPI_CLK},
    {5u, 0u, P11_2, P11_2_SCB5_SPI_CLK},
    {6u, 0u, P12_2, P12_2_SCB6_SPI_CLK},
    {6u, 0u, P13_2, P13_2_SCB6_SPI_CLK},
};

/* Connections for: scb_spi_m_miso */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_m_miso[15] = {
    {0u, 0u, P0_3, P0_3_SCB0_SPI_MISO},
    {7u, 0u, P1_1, P1_1_SCB7_SPI_MISO},
    {1u, 0u, P2_1, P2_1_SCB1_SPI_MISO},
    {5u, 0u, P5_1, P5_1_SCB5_SPI_MISO},
    {3u, 0u, P6_1, P6_1_SCB3_SPI_MISO},
    {8u, 0u, P6_1, P6_1_SCB8_SPI_MISO},
    {6u, 0u, P6_5, P6_5_SCB6_SPI_MISO},
    {8u, 0u, P6_5, P6_5_SCB8_SPI_MISO},
    {4u, 0u, P7_1, P7_1_SCB4_SPI_MISO},
    {4u, 0u, P8_1, P8_1_SCB4_SPI_MISO},
    {2u, 0u, P9_1, P9_1_SCB2_SPI_MISO},
    {1u, 0u, P10_1, P10_1_SCB1_SPI_MISO},
    {5u, 0u, P11_1, P11_1_SCB5_SPI_MISO},
    {6u, 0u, P12_1, P12_1_SCB6_SPI_MISO},
    {6u, 0u, P13_1, P13_1_SCB6_SPI_MISO},
};

/* Connections for: scb_spi_m_mosi */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_m_mosi[15] = {
    {0u, 0u, P0_2, P0_2_SCB0_SPI_MOSI},
    {7u, 0u, P1_0, P1_0_SCB7_SPI_MOSI},
    {1u, 0u, P2_0, P2_0_SCB1_SPI_MOSI},
    {5u, 0u, P5_0, P5_0_SCB5_SPI_MOSI},
    {3u, 0u, P6_0, P6_0_SCB3_SPI_MOSI},
    {8u, 0u, P6_0, P6_0_SCB8_SPI_MOSI},
    {6u, 0u, P6_4, P6_4_SCB6_SPI_MOSI},
    {8u, 0u, P6_4, P6_4_SCB8_SPI_MOSI},
    {4u, 0u, P7_0, P7_0_SCB4_SPI_MOSI},
    {4u, 0u, P8_0, P8_0_SCB4_SPI_MOSI},
    {2u, 0u, P9_0, P9_0_SCB2_SPI_MOSI},
    {1u, 0u, P10_0, P10_0_SCB1_SPI_MOSI},
    {5u, 0u, P11_0, P11_0_SCB5_SPI_MOSI},
    {6u, 0u, P12_0, P12_0_SCB6_SPI_MOSI},
    {6u, 0u, P13_0, P13_0_SCB6_SPI_MOSI},
};

/* Connections for: scb_spi_m_select0 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_m_select0[14] = {
    {0u, 0u, P0_5, P0_5_SCB0_SPI_SELECT0},
    {1u, 0u, P2_3, P2_3_SCB1_SPI_SELECT0},
    {5u, 0u, P5_3, P5_3_SCB5_SPI_SELECT0},
    {3u, 0u, P6_3, P6_3_SCB3_SPI_SELECT0},
    {8u, 0u, P6_3, P6_3_SCB8_SPI_SELECT0},
    {6u, 0u, P6_7, P6_7_SCB6_SPI_SELECT0},
    {8u, 0u, P6_7, P6_7_SCB8_SPI_SELECT0},
    {4u, 0u, P7_3, P7_3_SCB4_SPI_SELECT0},
    {4u, 0u, P8_3, P8_3_SCB4_SPI_SELECT0},
    {2u, 0u, P9_3, P9_3_SCB2_SPI_SELECT0},
    {1u, 0u, P10_3, P10_3_SCB1_SPI_SELECT0},
    {5u, 0u, P11_3, P11_3_SCB5_SPI_SELECT0},
    {6u, 0u, P12_3, P12_3_SCB6_SPI_SELECT0},
    {6u, 0u, P13_3, P13_3_SCB6_SPI_SELECT0},
};

/* Connections for: scb_spi_m_select1 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_m_select1[11] = {
    {0u, 0u, P0_0, P0_0_SCB0_SPI_SELECT1},
    {7u, 0u, P1_4, P1_4_SCB7_SPI_SELECT1},
    {1u, 0u, P2_4, P2_4_SCB1_SPI_SELECT1},
    {5u, 0u, P5_4, P5_4_SCB5_SPI_SELECT1},
    {3u, 0u, P7_7, P7_7_SCB3_SPI_SELECT1},
    {4u, 0u, P8_4, P8_4_SCB4_SPI_SELECT1},
    {2u, 0u, P9_4, P9_4_SCB2_SPI_SELECT1},
    {1u, 0u, P10_4, P10_4_SCB1_SPI_SELECT1},
    {5u, 0u, P11_4, P11_4_SCB5_SPI_SELECT1},
    {6u, 0u, P12_4, P12_4_SCB6_SPI_SELECT1},
    {6u, 0u, P13_4, P13_4_SCB6_SPI_SELECT1},
};

/* Connections for: scb_spi_m_select2 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_m_select2[8] = {
    {0u, 0u, P0_1, P0_1_SCB0_SPI_SELECT2},
    {7u, 0u, P1_5, P1_5_SCB7_SPI_SELECT2},
    {1u, 0u, P2_5, P2_5_SCB1_SPI_SELECT2},
    {5u, 0u, P5_5, P5_5_SCB5_SPI_SELECT2},
    {1u, 0u, P10_5, P10_5_SCB1_SPI_SELECT2},
    {5u, 0u, P11_5, P11_5_SCB5_SPI_SELECT2},
    {6u, 0u, P12_5, P12_5_SCB6_SPI_SELECT2},
    {6u, 0u, P13_5, P13_5_SCB6_SPI_SELECT2},
};

/* Connections for: scb_spi_m_select3 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_m_select3[7] = {
    {1u, 0u, P2_6, P2_6_SCB1_SPI_SELECT3},
    {5u, 0u, P5_6, P5_6_SCB5_SPI_SELECT3},
    {3u, 0u, P5_7, P5_7_SCB3_SPI_SELECT3},
    {1u, 0u, P10_6, P10_6_SCB1_SPI_SELECT3},
    {5u, 0u, P11_6, P11_6_SCB5_SPI_SELECT3},
    {6u, 0u, P12_6, P12_6_SCB6_SPI_SELECT3},
    {6u, 0u, P13_6, P13_6_SCB6_SPI_SELECT3},
};

/* Connections for: scb_spi_s_clk */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_s_clk[14] = {
    {0u, 0u, P0_4, P0_4_SCB0_SPI_CLK},
    {1u, 0u, P2_2, P2_2_SCB1_SPI_CLK},
    {5u, 0u, P5_2, P5_2_SCB5_SPI_CLK},
    {3u, 0u, P6_2, P6_2_SCB3_SPI_CLK},
    {8u, 0u, P6_2, P6_2_SCB8_SPI_CLK},
    {6u, 0u, P6_6, P6_6_SCB6_SPI_CLK},
    {8u, 0u, P6_6, P6_6_SCB8_SPI_CLK},
    {4u, 0u, P7_2, P7_2_SCB4_SPI_CLK},
    {4u, 0u, P8_2, P8_2_SCB4_SPI_CLK},
    {2u, 0u, P9_2, P9_2_SCB2_SPI_CLK},
    {1u, 0u, P10_2, P10_2_SCB1_SPI_CLK},
    {5u, 0u, P11_2, P11_2_SCB5_SPI_CLK},
    {6u, 0u, P12_2, P12_2_SCB6_SPI_CLK},
    {6u, 0u, P13_2, P13_2_SCB6_SPI_CLK},
};

/* Connections for: scb_spi_s_miso */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_spi_s_miso[15] = {
    {0u, 0u, P0_3, P0_3_SCB0_SPI_MISO},
    {7u, 0u, P1_1, P1_1_SCB7_SPI_MISO},
    {1u, 0u, P2_1, P2_1_SCB1_SPI_MISO},
    {5u, 0u, P5_1, P5_1_SCB5_SPI_MISO},
    {3u, 0u, P6_1, P6_1_SCB3_SPI_MISO},
    {8u, 0u, P6_1, P6_1_SCB8_SPI_MISO},
    {6u, 0u, P6_5, P6_5_SCB6_SPI_MISO},
    {8u, 0u, P6_5, P6_5_SCB8_SPI_MISO},
    {4u, 0u, P7_1, P7_1_SCB4_SPI_MISO},
    {4u, 0u, P8_1, P8_1_SCB4_SPI_MISO},
    {2u, 0u, P9_1, P9_1_SCB2_SPI_MISO},
    {1u, 0u, P10_1, P10_1_SCB1_SPI_MISO},
    {5u, 0u, P11_1, P11_1_SCB5_SPI_MISO},
    {6u, 0u, P12_1, P12_1_SCB6_SPI_MISO},
    {6u, 0u, P13_1, P13_1_SCB6_SPI_MISO},
};

